{
  "42": "Purpose: This is the introductory title frame, clearly stating the destination 'GangNeung'.\nSubject: Essential for branding and immediately sets the video's core focus.",
  "88": "Cine: Excellent composition with the subject silhouetted against the sunset, highlighting a peaceful activity on the beach.\nStory: Establishes a theme of relaxation and natural beauty early in the narrative.",
  "120": "Cine: Showcases unique 360-degree camera work, creating a warped perspective of a car driving through a tunnel.\nEdit: Represents a dynamic transition or journey, adding a visually engaging and modern feel.",
  "182": "Cine: Features an interesting architectural structure (stairs/bridge) integrated with nature, viewed with a 360-degree lens.\nStory: Indicates exploration and discovery of unique viewpoints within the destination.",
  "219": "Cine: Captures the vastness of the ocean from a high vantage point, with the subject observing the scenic beauty.\nPurpose: Effectively promotes the destination's stunning coastal landscapes and immersive experiences.",
  "320": "Cine: Striking use of color with the red fabric installation, creating a unique and artistic indoor environment.\nStory: Represents a shift to cultural or artistic attractions, showcasing diversity beyond nature.",
  "360": "Edit: Demonstrates a creative visual transition or glitch effect, adding dynamic flair to the video's editing style.\nCine: Breaks the traditional visual flow, indicating a modern and engaging production approach.",
  "405": "Cine: Highlights a contemporary architectural structure with strong leading lines, showing a different facet of the destination.\nStory: Suggests a journey through modern art or unique urban/architectural spaces.",
  "486": "Subject: Focuses on the act of capturing memories with a smartphone, resonating with modern travel behaviors.\nPurpose: Implies that the destination offers many 'Instagrammable' moments, encouraging visitor interaction.",
  "513": "Subject: Clearly shows an adventurous activity (ziplining) with an overlaid text 'ACTIVITY'.\nPurpose: Promotes thrilling experiences available, broadening the appeal of the destination to active travelers.",
  "566": "Subject: Showcases the culinary aspect of the destination with an overhead shot of the protagonist enjoying a meal.\nPurpose: Highlights local food and dining experiences, a key element of travel attraction.",
  "651": "Edit: Features a dynamic collage of diverse scenes, summarizing different experiences visually.\nStory: Acts as a narrative device to quickly convey the variety of 'hot spots' the destination offers.",
  "717": "Cine: Offers a breathtaking panoramic view of a mountain landscape with windmills at sunset, emphasizing natural grandeur.\nPurpose: Conveys a sense of freedom and natural beauty, appealing to nature lovers.",
  "765": "Cine: Captures an immersive nighttime experience under an illuminated lantern tunnel, creating a magical atmosphere.\nStory: Illustrates cultural events or night-time attractions, showcasing the destination's vibrant evenings.",
  "891": "Cine: A wide shot of the beach with colorful photo frames, inviting viewer interaction and showing a unique attraction.\nPurpose: Promotes a specific, Instagram-friendly spot that encourages visitors to create and share memories."
}